ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
#define BITM_TMR_STAT_BUSY                   (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Timer Busy */

#define BITM_TMR_STAT_CAPTURE                (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Capture event pending */

#define BITM_TMR_STAT_TIMEOUT                (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Timeout event occurred */

/* -------------------------------------------------------------------------------------------------------------------------
          TMR_PWMCTL                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TMR_PWMCTL_IDLESTATE             1            /*  PWM Idle State */
#define BITP_TMR_PWMCTL_MATCH                 0            /*  PWM Match enabled */
#define BITM_TMR_PWMCTL_IDLESTATE            (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  PWM Idle State */
#define BITM_TMR_PWMCTL_MATCH                (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  PWM Match enabled */

/* -------------------------------------------------------------------------------------------------------------------------
          TMR_PWMMATCH                         Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TMR_PWMMATCH_VALUE               0            /*  PWM Match Value */
#define BITM_TMR_PWMMATCH_VALUE              (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  PWM Match Value */

/* -------------------------------------------------------------------------------------------------------------------------
          TMR_EVENTSELECT                      Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TMR_EVENTSELECT_EVTRANGE         0            /*  Event select range */
#define BITM_TMR_EVENTSELECT_EVTRANGE        (_ADI_MSK_3(0x0000003F,0x0000003FU, uint16_t  ))    /*  Event select range */


/* ============================================================================================================================
        Timer_RGB with 3 PWM outputs
   ============================================================================================================================ */

/* ============================================================================================================================
        TMR_RGB
   ============================================================================================================================ */
#define REG_TMR_RGB_LOAD                     0x40000C00            /*  TMR_RGB 16-bit load value */
#define REG_TMR_RGB_CURCNT                   0x40000C04            /*  TMR_RGB 16-bit timer value */
#define REG_TMR_RGB_CTL                      0x40000C08            /*  TMR_RGB Control */
#define REG_TMR_RGB_CLRINT                   0x40000C0C            /*  TMR_RGB Clear Interrupt */
#define REG_TMR_RGB_CAPTURE                  0x40000C10            /*  TMR_RGB Capture */
#define REG_TMR_RGB_ALOAD                    0x40000C14            /*  TMR_RGB 16-bit load value, asynchronous */
#define REG_TMR_RGB_ACURCNT                  0x40000C18            /*  TMR_RGB 16-bit timer value, asynchronous */
#define REG_TMR_RGB_STAT                     0x40000C1C            /*  TMR_RGB Status */
#define REG_TMR_RGB_PWM0CTL                  0x40000C20            /*  TMR_RGB PWM0 Control Register */
#define REG_TMR_RGB_PWM0MATCH                0x40000C24            /*  TMR_RGB PWM0 Match Value */
#define REG_TMR_RGB_EVENTSELECT              0x40000C28            /*  TMR_RGB Timer Event selection Register */
#define REG_TMR_RGB_PWM1CTL                  0x40000C2C            /*  TMR_RGB PWM1 Control Register */
#define REG_TMR_RGB_PWM1MATCH                0x40000C30            /*  TMR_RGB PWM1 Match Value */
#define REG_TMR_RGB_PWM2CTL                  0x40000C34            /*  TMR_RGB PWM2 Control Register */
#define REG_TMR_RGB_PWM2MATCH                0x40000C38            /*  TMR_RGB PWM2 Match Value */

/* ============================================================================================================================
        TMR_RGB Register BitMasks, Positions & Enumerations 
   ============================================================================================================================ */
/* -------------------------------------------------------------------------------------------------------------------------
          TMR_RGB_LOAD                         Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TMR_RGB_LOAD_VALUE               0            /*  Load value */
#define BITM_TMR_RGB_LOAD_VALUE              (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Load value */

/* -------------------------------------------------------------------------------------------------------------------------
          TMR_RGB_CURCNT                       Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TMR_RGB_CURCNT_VALUE             0            /*  Current count */
#define BITM_TMR_RGB_CURCNT_VALUE            (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Current count */

/* -------------------------------------------------------------------------------------------------------------------------
          TMR_RGB_CTL                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_TMR_RGB_CTL_SYNCBYP             15            /*  Synchronization bypass */
#define BITP_TMR_RGB_CTL_RSTEN               14            /*  Counter and prescale reset enable */
#define BITP_TMR_RGB_CTL_EVTEN               13            /*  Event select */
#define BITP_TMR_RGB_CTL_RLD                  7            /*  Reload control */
#define BITP_TMR_RGB_CTL_CLK                  5            /*  Clock select */
#define BITP_TMR_RGB_CTL_EN                   4            /*  Timer enable */
#define BITP_TMR_RGB_CTL_MODE                 3            /*  Timer mode */
#define BITP_TMR_RGB_CTL_UP                   2            /*  Count up */
#define BITP_TMR_RGB_CTL_PRE                  0            /*  Prescaler */
#define BITM_TMR_RGB_CTL_SYNCBYP             (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Synchronization bypass */
#define BITM_TMR_RGB_CTL_RSTEN               (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Counter and prescale reset enable */

