ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
/* ============================================================================================================================
        Real-Time Clock
   ============================================================================================================================ */

/* ============================================================================================================================
        RTC0
   ============================================================================================================================ */
#define REG_RTC0_CR0                         0x40001000            /*  RTC0 RTC Control 0 */
#define REG_RTC0_SR0                         0x40001004            /*  RTC0 RTC Status 0 */
#define REG_RTC0_SR1                         0x40001008            /*  RTC0 RTC Status 1 */
#define REG_RTC0_CNT0                        0x4000100C            /*  RTC0 RTC Count 0 */
#define REG_RTC0_CNT1                        0x40001010            /*  RTC0 RTC Count 1 */
#define REG_RTC0_ALM0                        0x40001014            /*  RTC0 RTC Alarm 0 */
#define REG_RTC0_ALM1                        0x40001018            /*  RTC0 RTC Alarm 1 */
#define REG_RTC0_TRM                         0x4000101C            /*  RTC0 RTC Trim */
#define REG_RTC0_GWY                         0x40001020            /*  RTC0 RTC Gateway */
#define REG_RTC0_CR1                         0x40001028            /*  RTC0 RTC Control 1 */
#define REG_RTC0_SR2                         0x4000102C            /*  RTC0 RTC Status 2 */
#define REG_RTC0_SNAP0                       0x40001030            /*  RTC0 RTC Snapshot 0 */
#define REG_RTC0_SNAP1                       0x40001034            /*  RTC0 RTC Snapshot 1 */
#define REG_RTC0_SNAP2                       0x40001038            /*  RTC0 RTC Snapshot 2 */
#define REG_RTC0_MOD                         0x4000103C            /*  RTC0 RTC Modulo */
#define REG_RTC0_CNT2                        0x40001040            /*  RTC0 RTC Count 2 */
#define REG_RTC0_ALM2                        0x40001044            /*  RTC0 RTC Alarm 2 */
#define REG_RTC0_SR3                         0x40001048            /*  RTC0 RTC Status 3 */
#define REG_RTC0_CR2IC                       0x4000104C            /*  RTC0 RTC Control 2 for Configuring Input Capture Channels */
#define REG_RTC0_CR3OC                       0x40001050            /*  RTC0 RTC Control 3 for Configuring Output Compare Channel */
#define REG_RTC0_CR4OC                       0x40001054            /*  RTC0 RTC Control 4 for Configuring Output Compare Channel */
#define REG_RTC0_OCMSK                       0x40001058            /*  RTC0 RTC Masks for Output Compare Channel */
#define REG_RTC0_IC2                         0x40001064            /*  RTC0 RTC Input Capture Channel 2 */
#define REG_RTC0_IC3                         0x40001068            /*  RTC0 RTC Input Capture Channel 3 */
#define REG_RTC0_IC4                         0x4000106C            /*  RTC0 RTC Input Capture Channel 4 */
#define REG_RTC0_OC1                         0x40001070            /*  RTC0 RTC Output Compare Channel 1 */
#define REG_RTC0_OC2                         0x40001074            /*  RTC0 RTC Output Compare Channel 2 */
#define REG_RTC0_OC3                         0x40001078            /*  RTC0 RTC Output Compare Channel 3 */
#define REG_RTC0_OC4                         0x4000107C            /*  RTC0 RTC Output Compare Channel 4 */
#define REG_RTC0_SR4                         0x40001080            /*  RTC0 RTC Status 4 */
#define REG_RTC0_SR5                         0x40001084            /*  RTC0 RTC Status 5 */
#define REG_RTC0_SR6                         0x40001088            /*  RTC0 RTC Status 6 */
#define REG_RTC0_OC1TGT                      0x4000108C            /*  RTC0 RTC Output Compare Channel 1 Target */
#define REG_RTC0_FRZCNT                      0x40001090            /*  RTC0 RTC Freeze Count */
#define REG_RTC0_OC2TGT                      0x40001094            /*  RTC0 RTC Output Compare Channel 2 Target */
#define REG_RTC0_OC3TGT                      0x40001098            /*  RTC0 RTC Output Compare Channel 3 Target */
#define REG_RTC0_OC1LOWDUR                   0x400010A0            /*  RTC0 RTC Auto-Reload Low Duration for Output Compare Channel 1 */
#define REG_RTC0_OC2LOWDUR                   0x400010A4            /*  RTC0 RTC Auto-Reload Low Duration for Output Compare Channel 2 */
#define REG_RTC0_OC3LOWDUR                   0x400010A8            /*  RTC0 RTC Auto-Reload Low Duration for Output Compare Channel 3 */
#define REG_RTC0_OC1HIGHDUR                  0x400010B0            /*  RTC0 RTC Auto-Reload High Duration for Output Compare Channel 1 */
#define REG_RTC0_OC2HIGHDUR                  0x400010B4            /*  RTC0 RTC Auto-Reload High Duration for Output Compare Channel 2 */
#define REG_RTC0_OC3HIGHDUR                  0x400010B8            /*  RTC0 RTC Auto-Reload High Duration for Output Compare Channel 3 */
#define REG_RTC0_OCMSKOT                     0x400010C0            /*  RTC0 RTC Masks for Output Compare Channel */
#define REG_RTC0_CR5OCS                      0x400010C4            /*  RTC0 RTC Control 5 for Configuring Output Compare Channel GPIO Sampling */
#define REG_RTC0_CR6OCS                      0x400010C8            /*  RTC0 RTC Control 5 for Configuring Output Compare Channel GPIO Sampling Edge */
#define REG_RTC0_CR7OCS                      0x400010CC            /*  RTC0 RTC Control 5 for Configuring Output Compare Channel GPIO Sampling Activity */
#define REG_RTC0_SR7                         0x400010D0            /*  RTC0 RTC Status 7 */
#define REG_RTC0_SR8                         0x400010D4            /*  RTC0 RTC Status 8 */
#define REG_RTC0_SR9                         0x400010D8            /*  RTC0 RTC Status 9 */
#define REG_RTC0_GPMUX0                      0x400010E0            /*  RTC0 RTC GPIO pin mux control register 0 */
#define REG_RTC0_GPMUX1                      0x400010E4            /*  RTC0 RTC GPIO pin mux control register 1 */

