ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
/* ============================================================================================================================
        RTC1
   ============================================================================================================================ */
#define REG_RTC1_CR0                         0x40001400            /*  RTC1 RTC Control 0 */
#define REG_RTC1_SR0                         0x40001404            /*  RTC1 RTC Status 0 */
#define REG_RTC1_SR1                         0x40001408            /*  RTC1 RTC Status 1 */
#define REG_RTC1_CNT0                        0x4000140C            /*  RTC1 RTC Count 0 */
#define REG_RTC1_CNT1                        0x40001410            /*  RTC1 RTC Count 1 */
#define REG_RTC1_ALM0                        0x40001414            /*  RTC1 RTC Alarm 0 */
#define REG_RTC1_ALM1                        0x40001418            /*  RTC1 RTC Alarm 1 */
#define REG_RTC1_TRM                         0x4000141C            /*  RTC1 RTC Trim */
#define REG_RTC1_GWY                         0x40001420            /*  RTC1 RTC Gateway */
#define REG_RTC1_CR1                         0x40001428            /*  RTC1 RTC Control 1 */
#define REG_RTC1_SR2                         0x4000142C            /*  RTC1 RTC Status 2 */
#define REG_RTC1_SNAP0                       0x40001430            /*  RTC1 RTC Snapshot 0 */
#define REG_RTC1_SNAP1                       0x40001434            /*  RTC1 RTC Snapshot 1 */
#define REG_RTC1_SNAP2                       0x40001438            /*  RTC1 RTC Snapshot 2 */
#define REG_RTC1_MOD                         0x4000143C            /*  RTC1 RTC Modulo */
#define REG_RTC1_CNT2                        0x40001440            /*  RTC1 RTC Count 2 */
#define REG_RTC1_ALM2                        0x40001444            /*  RTC1 RTC Alarm 2 */
#define REG_RTC1_SR3                         0x40001448            /*  RTC1 RTC Status 3 */
#define REG_RTC1_CR2IC                       0x4000144C            /*  RTC1 RTC Control 2 for Configuring Input Capture Channels */
#define REG_RTC1_CR3OC                       0x40001450            /*  RTC1 RTC Control 3 for Configuring Output Compare Channel */
#define REG_RTC1_CR4OC                       0x40001454            /*  RTC1 RTC Control 4 for Configuring Output Compare Channel */
#define REG_RTC1_OCMSK                       0x40001458            /*  RTC1 RTC Masks for Output Compare Channel */
#define REG_RTC1_IC2                         0x40001464            /*  RTC1 RTC Input Capture Channel 2 */
#define REG_RTC1_IC3                         0x40001468            /*  RTC1 RTC Input Capture Channel 3 */
#define REG_RTC1_IC4                         0x4000146C            /*  RTC1 RTC Input Capture Channel 4 */
#define REG_RTC1_OC1                         0x40001470            /*  RTC1 RTC Output Compare Channel 1 */
#define REG_RTC1_OC2                         0x40001474            /*  RTC1 RTC Output Compare Channel 2 */
#define REG_RTC1_OC3                         0x40001478            /*  RTC1 RTC Output Compare Channel 3 */
#define REG_RTC1_OC4                         0x4000147C            /*  RTC1 RTC Output Compare Channel 4 */
#define REG_RTC1_SR4                         0x40001480            /*  RTC1 RTC Status 4 */
#define REG_RTC1_SR5                         0x40001484            /*  RTC1 RTC Status 5 */
#define REG_RTC1_SR6                         0x40001488            /*  RTC1 RTC Status 6 */
#define REG_RTC1_OC1TGT                      0x4000148C            /*  RTC1 RTC Output Compare Channel 1 Target */
#define REG_RTC1_FRZCNT                      0x40001490            /*  RTC1 RTC Freeze Count */
#define REG_RTC1_OC2TGT                      0x40001494            /*  RTC1 RTC Output Compare Channel 2 Target */
#define REG_RTC1_OC3TGT                      0x40001498            /*  RTC1 RTC Output Compare Channel 3 Target */
#define REG_RTC1_OC1LOWDUR                   0x400014A0            /*  RTC1 RTC Auto-Reload Low Duration for Output Compare Channel 1 */
#define REG_RTC1_OC2LOWDUR                   0x400014A4            /*  RTC1 RTC Auto-Reload Low Duration for Output Compare Channel 2 */
#define REG_RTC1_OC3LOWDUR                   0x400014A8            /*  RTC1 RTC Auto-Reload Low Duration for Output Compare Channel 3 */
#define REG_RTC1_OC1HIGHDUR                  0x400014B0            /*  RTC1 RTC Auto-Reload High Duration for Output Compare Channel 1 */
#define REG_RTC1_OC2HIGHDUR                  0x400014B4            /*  RTC1 RTC Auto-Reload High Duration for Output Compare Channel 2 */
#define REG_RTC1_OC3HIGHDUR                  0x400014B8            /*  RTC1 RTC Auto-Reload High Duration for Output Compare Channel 3 */
#define REG_RTC1_OCMSKOT                     0x400014C0            /*  RTC1 RTC Masks for Output Compare Channel */
#define REG_RTC1_CR5OCS                      0x400014C4            /*  RTC1 RTC Control 5 for Configuring Output Compare Channel GPIO Sampling */
#define REG_RTC1_CR6OCS                      0x400014C8            /*  RTC1 RTC Control 5 for Configuring Output Compare Channel GPIO Sampling Edge */
#define REG_RTC1_CR7OCS                      0x400014CC            /*  RTC1 RTC Control 5 for Configuring Output Compare Channel GPIO Sampling Activity */
#define REG_RTC1_SR7                         0x400014D0            /*  RTC1 RTC Status 7 */
#define REG_RTC1_SR8                         0x400014D4            /*  RTC1 RTC Status 8 */
#define REG_RTC1_SR9                         0x400014D8            /*  RTC1 RTC Status 9 */
#define REG_RTC1_GPMUX0                      0x400014E0            /*  RTC1 RTC GPIO pin mux control register 0 */
#define REG_RTC1_GPMUX1                      0x400014E4            /*  RTC1 RTC GPIO pin mux control register 1 */

/* ============================================================================================================================
        RTC Register BitMasks, Positions & Enumerations 
   ============================================================================================================================ */
/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR0                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR0_WPNDINTEN               15            /*  Enable Write Pending sourced interrupts to the CPU */
#define BITP_RTC_CR0_WSYNCINTEN              14            /*  Enable Write synchronization sourced interrupts to the CPU */
#define BITP_RTC_CR0_WPNDERRINTEN            13            /*  Enable Write pending error sourced interrupts to the CPU when an RTC register-write pending error occurs */
#define BITP_RTC_CR0_ISOINTEN                12            /*  Enable RTC power-domain isolation sourced interrupts to the CPU when isolation of the RTC power domain is activated and subsequently de-activated */
#define BITP_RTC_CR0_MOD60ALMINTEN           11            /*  Enable periodic Modulo-60 RTC alarm sourced interrupts to the CPU */
#define BITP_RTC_CR0_MOD60ALM                 5            /*  Periodic, modulo-60 alarm time in prescaled RTC time units beyond a modulo-60 boundary */
#define BITP_RTC_CR0_MOD60ALMEN               4            /*  Enable RTC modulo-60 counting of time past a modulo-60 boundary */
#define BITP_RTC_CR0_TRMEN                    3            /*  Enable RTC digital trimming */
#define BITP_RTC_CR0_ALMINTEN                 2            /*  Enable sourced alarm interrupts to the CPU */
#define BITP_RTC_CR0_ALMEN                    1            /*  Enable the RTC alarm (absolute) operation */
#define BITP_RTC_CR0_CNTEN                    0            /*  Global enable for the RTC */

#define BITM_RTC_CR0_WPNDINTEN               (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Enable Write Pending sourced interrupts to the CPU */

#define BITM_RTC_CR0_WSYNCINTEN              (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Enable Write synchronization sourced interrupts to the CPU */

#define BITM_RTC_CR0_WPNDERRINTEN            (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Enable Write pending error sourced interrupts to the CPU when an RTC register-write pending error occurs */

