ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
#define BITM_RTC_SR3_RTCOC2IRQ               (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Sticky Interrupt Source for the RTCOC2 Output Compare channel */

#define BITM_RTC_SR3_RTCOC1IRQ               (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Sticky Interrupt Source for Output Compare Channel 1 */

#define BITM_RTC_SR3_RTCOC4FEIRQ             (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Sticky Interrupt Source for the RTCOC4 Output Compare channel falling edge */

#define BITM_RTC_SR3_RTCOC3FEIRQ             (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  Sticky Interrupt Source for the RTCOC3 Output Compare channel falling edge */

#define BITM_RTC_SR3_RTCOC2FEIRQ             (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Sticky Interrupt Source for the RTCOC2 Output Compare channel falling edge */

#define BITM_RTC_SR3_RTCOC1FEIRQ             (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Sticky Interrupt Source for Output Compare Channel 1 */

#define BITM_RTC_SR3_RTCIC4IRQ               (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Sticky Interrupt Source for the RTC Input Capture Channel 4 */

#define BITM_RTC_SR3_RTCIC3IRQ               (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Sticky Interrupt Source for the RTC Input Capture Channel 3 */

#define BITM_RTC_SR3_RTCIC2IRQ               (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Sticky Interrupt Source for the RTC Input Capture Channel 2 */

#define BITM_RTC_SR3_RTCIC0IRQ               (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Sticky Interrupt Source for the RTC Input Capture Channel 0 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR2IC                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR2IC_RTCICOWUSEN           15            /*  Enable Overwrite of Unread Snapshots for all RTC Input Capture Channels */
#define BITP_RTC_CR2IC_RTCIC4IRQEN           14            /*  Interrupt Enable for the RTC Input Capture Channel 4 */
#define BITP_RTC_CR2IC_RTCIC3IRQEN           13            /*  Interrupt Enable for the RTC Input Capture Channel 3 */
#define BITP_RTC_CR2IC_RTCIC2IRQEN           12            /*  Interrupt Enable for the RTC Input Capture Channel 2 */
#define BITP_RTC_CR2IC_RTCIC0IRQEN           10            /*  Interrupt Enable for the RTC Input Capture Channel 0 */
#define BITP_RTC_CR2IC_RTCIC4LH               9            /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 4 */
#define BITP_RTC_CR2IC_RTCIC3LH               8            /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 3 */
#define BITP_RTC_CR2IC_RTCIC2LH               7            /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 2 */
#define BITP_RTC_CR2IC_RTCIC0LH               5            /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 0 */
#define BITP_RTC_CR2IC_RTCIC4EN               4            /*  Enable for the RTC Input Capture Channel 4 */
#define BITP_RTC_CR2IC_RTCIC3EN               3            /*  Enable for the RTC Input Capture Channel 3 */
#define BITP_RTC_CR2IC_RTCIC2EN               2            /*  Enable for the RTC Input Capture Channel 2 */
#define BITP_RTC_CR2IC_RTCIC0EN               0            /*  Enable for the RTC Input Capture Channel 0 */

#define BITM_RTC_CR2IC_RTCICOWUSEN           (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Enable Overwrite of Unread Snapshots for all RTC Input Capture Channels */

#define BITM_RTC_CR2IC_RTCIC4IRQEN           (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Interrupt Enable for the RTC Input Capture Channel 4 */

#define BITM_RTC_CR2IC_RTCIC3IRQEN           (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Interrupt Enable for the RTC Input Capture Channel 3 */

#define BITM_RTC_CR2IC_RTCIC2IRQEN           (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Interrupt Enable for the RTC Input Capture Channel 2 */

#define BITM_RTC_CR2IC_RTCIC0IRQEN           (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Interrupt Enable for the RTC Input Capture Channel 0 */

#define BITM_RTC_CR2IC_RTCIC4LH              (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 4 */

#define BITM_RTC_CR2IC_RTCIC3LH              (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 3 */

#define BITM_RTC_CR2IC_RTCIC2LH              (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 2 */

#define BITM_RTC_CR2IC_RTCIC0LH              (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Polarity of the active-going capture edge for the RTC Input Capture Channel 0 */

#define BITM_RTC_CR2IC_RTCIC4EN              (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Enable for the RTC Input Capture Channel 4 */

#define BITM_RTC_CR2IC_RTCIC3EN              (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Enable for the RTC Input Capture Channel 3 */

#define BITM_RTC_CR2IC_RTCIC2EN              (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Enable for the RTC Input Capture Channel 2 */

#define BITM_RTC_CR2IC_RTCIC0EN              (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Enable for the RTC Input Capture Channel 0 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR3OC                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR3OC_RTCOC4IRQEN           12            /*  Posedge EdgeInterrupt Enable for the RTCOC4 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC3IRQEN           11            /*  Posedge EdgeInterrupt Enable for the RTCOC3 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC2IRQEN           10            /*  Posedge EdgeInterrupt Enable for the RTCOC2 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC1IRQEN            9            /*  Interrupt Enable for Output Compare Channel 1 */
#define BITP_RTC_CR3OC_RTCOC4FEIRQEN          8            /*  Falling Edge Interrupt Enable for the RTCOC4 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC3FEIRQEN          7            /*  Falling Edge Interrupt Enable for the RTCOC3 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC2FEIRQEN          6            /*  Falling Edge Interrupt Enable for the RTCOC2 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC1FEIRQEN          5            /*  Falling Edge Interrupt Enable for the RTCOC1 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC4EN               4            /*  Enable for the RTCOC4 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC3EN               3            /*  Enable for the RTCOC3 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC2EN               2            /*  Enable for the RTCOC2 Output Compare channel */
#define BITP_RTC_CR3OC_RTCOC1EN               1            /*  Enable for Output Compare Channel 1 */

#define BITM_RTC_CR3OC_RTCOC4IRQEN           (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Posedge EdgeInterrupt Enable for the RTCOC4 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC3IRQEN           (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  Posedge EdgeInterrupt Enable for the RTCOC3 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC2IRQEN           (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Posedge EdgeInterrupt Enable for the RTCOC2 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC1IRQEN           (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Interrupt Enable for Output Compare Channel 1 */

#define BITM_RTC_CR3OC_RTCOC4FEIRQEN         (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Falling Edge Interrupt Enable for the RTCOC4 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC3FEIRQEN         (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  Falling Edge Interrupt Enable for the RTCOC3 Output Compare channel */

