ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
#define BITM_RTC_CR3OC_RTCOC2FEIRQEN         (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Falling Edge Interrupt Enable for the RTCOC2 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC1FEIRQEN         (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Falling Edge Interrupt Enable for the RTCOC1 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC4EN              (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Enable for the RTCOC4 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC3EN              (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Enable for the RTCOC3 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC2EN              (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Enable for the RTCOC2 Output Compare channel */

#define BITM_RTC_CR3OC_RTCOC1EN              (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Enable for Output Compare Channel 1 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR4OC                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR4OC_RTCOC3ARLEN           11            /*  Enable for fine control on RTCOC3 period and duty cycle. */
#define BITP_RTC_CR4OC_RTCOC2ARLEN           10            /*  Enable for fine control on RTCOC2 period and duty cycle. */
#define BITP_RTC_CR4OC_RTCOC1ARLEN            9            /*  Enable for fine control on RTCOC1 period and duty cycle. */
#define BITP_RTC_CR4OC_RTCOC4POL              8            /*  RTCOC4 Polarity Control */
#define BITP_RTC_CR4OC_RTCOC3POL              7            /*  RTCOC3 Polarity Control */
#define BITP_RTC_CR4OC_RTCOC2POL              6            /*  RTCOC2 Polarity Control */
#define BITP_RTC_CR4OC_RTCOC1POL              5            /*  RTCOC1 Polarity Control */
#define BITP_RTC_CR4OC_RTCOC4MSKEN            4            /*  Enable for thermometer-code masking of the Output Compare 4 channel. */
#define BITP_RTC_CR4OC_RTCOC3MSKEN            3            /*  Enable for thermometer-code masking of the Output Compare 3 channel. */
#define BITP_RTC_CR4OC_RTCOC2MSKEN            2            /*  Enable for thermometer-code masking of the Output Compare 2 channel. */
#define BITP_RTC_CR4OC_RTCOC1MSKEN            1            /*  Enable for thermometer-code masking of the Output Compare 1 Channel */

#define BITM_RTC_CR4OC_RTCOC3ARLEN           (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  Enable for fine control on RTCOC3 period and duty cycle. */

#define BITM_RTC_CR4OC_RTCOC2ARLEN           (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Enable for fine control on RTCOC2 period and duty cycle. */

#define BITM_RTC_CR4OC_RTCOC1ARLEN           (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Enable for fine control on RTCOC1 period and duty cycle. */

#define BITM_RTC_CR4OC_RTCOC4POL             (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  RTCOC4 Polarity Control */

#define BITM_RTC_CR4OC_RTCOC3POL             (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  RTCOC3 Polarity Control */

#define BITM_RTC_CR4OC_RTCOC2POL             (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  RTCOC2 Polarity Control */

#define BITM_RTC_CR4OC_RTCOC1POL             (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  RTCOC1 Polarity Control */

#define BITM_RTC_CR4OC_RTCOC4MSKEN           (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Enable for thermometer-code masking of the Output Compare 4 channel. */

#define BITM_RTC_CR4OC_RTCOC3MSKEN           (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Enable for thermometer-code masking of the Output Compare 3 channel. */

#define BITM_RTC_CR4OC_RTCOC2MSKEN           (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Enable for thermometer-code masking of the Output Compare 2 channel. */

#define BITM_RTC_CR4OC_RTCOC1MSKEN           (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Enable for thermometer-code masking of the Output Compare 1 Channel */
#define ENUM_RTC_CR4OC_EN000                 (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  RTCOC1MSKEN: Do not apply a mask to the 16-bit Output Compare channel ${.:OC1}. */
#define ENUM_RTC_CR4OC_EN001                 (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  RTCOC1MSKEN: Apply a thermometer-decoded mask to the 16-bit Output Compare channel ${.:OC1} provided that channel is enabled via ${.:CR3OC:RTCOC1EN} */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OCMSK                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OCMSK_RTCOC4MSK             12            /*  RTCOC4 period control */
#define BITP_RTC_OCMSK_RTCOC3MSK              8            /*  RTCOC3 period control */
#define BITP_RTC_OCMSK_RTCOC2MSK              4            /*  RTCOC2 period control */
#define BITP_RTC_OCMSK_RTCOC1MSK              0            /*  Concatenation of thermometer-encoded masks for the 16-bit output compare channels */
#define BITM_RTC_OCMSK_RTCOC4MSK             (_ADI_MSK_3(0x0000F000,0x0000F000U, uint16_t  ))    /*  RTCOC4 period control */
#define BITM_RTC_OCMSK_RTCOC3MSK             (_ADI_MSK_3(0x00000F00,0x00000F00U, uint16_t  ))    /*  RTCOC3 period control */
#define BITM_RTC_OCMSK_RTCOC2MSK             (_ADI_MSK_3(0x000000F0,0x000000F0U, uint16_t  ))    /*  RTCOC2 period control */
#define BITM_RTC_OCMSK_RTCOC1MSK             (_ADI_MSK_3(0x0000000F,0x0000000FU, uint16_t  ))    /*  Concatenation of thermometer-encoded masks for the 16-bit output compare channels */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_IC2                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_IC2_RTCIC2                   0            /*  RTC Input Capture Channel 2 */
#define BITM_RTC_IC2_RTCIC2                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Input Capture Channel 2 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_IC3                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_IC3_RTCIC3                   0            /*  RTC Input Capture Channel 3 */
#define BITM_RTC_IC3_RTCIC3                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Input Capture Channel 3 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_IC4                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_IC4_RTCIC4                   0            /*  RTC Input Capture Channel 4 */
#define BITM_RTC_IC4_RTCIC4                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Input Capture Channel 4 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC1                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC1_RTCOC1                   0            /*  RTC Output Compare 1 Channel */
#define BITM_RTC_OC1_RTCOC1                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Output Compare 1 Channel */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC2                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC2_RTCOC2                   0            /*  RTC Output Compare 2 channel. Scheduled alarm target time. */
#define BITM_RTC_OC2_RTCOC2                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Output Compare 2 channel. Scheduled alarm target time. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC3                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC3_RTCOC3                   0            /*  RTC Output Compare 3 channel. Scheduled alarm target time. */
#define BITM_RTC_OC3_RTCOC3                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Output Compare 3 channel. Scheduled alarm target time. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC4                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC4_RTCOC4                   0            /*  RTC Output Compare 4 channel. Scheduled alarm target time. */
#define BITM_RTC_OC4_RTCOC4                  (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Output Compare 4 channel. Scheduled alarm target time. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR4                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR4_WSYNCOCMSKOT            15            /*  Synchronization status of posted writes to RTC On Time Masks for Output Compare Channel Register */
#define BITP_RTC_SR4_RSYNCIC4                14            /*  Synchronization status of posted reads of RTC Input Channel 4 */
#define BITP_RTC_SR4_RSYNCIC3                13            /*  Synchronization status of posted reads of RTC Input Channel 3 */
#define BITP_RTC_SR4_RSYNCIC2                12            /*  Synchronization status of posted reads of RTC Input Channel 2 */
#define BITP_RTC_SR4_RSYNCIC0                10            /*  Synchronization status of posted reads of RTC Input Channel 0 */
#define BITP_RTC_SR4_WSYNCOC4                 9            /*  Synchronisation status of posted writes to RTCOC4 */
#define BITP_RTC_SR4_WSYNCOC3                 8            /*  Synchronisation status of posted writes to RTCOC3 */
#define BITP_RTC_SR4_WSYNCOC2                 7            /*  Synchronization status of posted writes to RTCOC2. */
#define BITP_RTC_SR4_WSYNCOC1                 6            /*  Synchronization status of posted writes to RTC Output Compare Channel 1 Register */
#define BITP_RTC_SR4_WSYNCOCMSK               4            /*  Synchronization status of posted writes to RTC Masks for Output Compare Channel Register */
#define BITP_RTC_SR4_WSYNCCR4OC               3            /*  Synchronization status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */
#define BITP_RTC_SR4_WSYNCCR3OC               2            /*  Synchronization status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */
#define BITP_RTC_SR4_WSYNCCR2IC               1            /*  Synchronization status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */
#define BITP_RTC_SR4_WSYNCSR3                 0            /*  Synchronization status of posted clearances to interrupt sources in RTC Status 3 Register */

#define BITM_RTC_SR4_WSYNCOCMSKOT            (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Synchronization status of posted writes to RTC On Time Masks for Output Compare Channel Register */

