ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
#define BITM_RTC_SR6_RTCFRZCNTPTR            (_ADI_MSK_3(0x00000600,0x00000600U, uint16_t  ))    /*  Pointer for the triple-read sequence of the RTC Freeze Count MMR */

#define BITM_RTC_SR6_RTCIC0SNAP              (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Confirmation that RTC Snapshot 0, 1, 2 registers reflect the value of RTC Input Capture Channel 0 */

#define BITM_RTC_SR6_RTCIC4UNR               (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Sticky unread status of the RTC Input Capture Channel 4 */

#define BITM_RTC_SR6_RTCIC3UNR               (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Sticky unread status of the RTC Input Capture Channel 3 */

#define BITM_RTC_SR6_RTCIC2UNR               (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Sticky unread status of the RTC Input Capture Channel 2 */

#define BITM_RTC_SR6_RTCIC0UNR               (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Sticky unread status of the RTC Input Capture Channel 0 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC1TGT                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC1TGT_RTCOC1TGT             0            /*  Provides visibility to the CPU of the current target value for the output-compare channel 1, taking account of any possible auto-reloading */
#define BITM_RTC_OC1TGT_RTCOC1TGT            (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Provides visibility to the CPU of the current target value for the output-compare channel 1, taking account of any possible auto-reloading */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_FRZCNT                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_FRZCNT_RTCFRZCNT             0            /*  RTC Freeze Count */
#define BITM_RTC_FRZCNT_RTCFRZCNT            (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  RTC Freeze Count */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC2TGT                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC2TGT_RTCOC2TGT             0            /*  Current, cumulative target time for Output Compare Channel 1, taking account of any auto-reloading */
#define BITM_RTC_OC2TGT_RTCOC2TGT            (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Current, cumulative target time for Output Compare Channel 1, taking account of any auto-reloading */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC3TGT                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC3TGT_RTCOC3TGT             0            /*  Current, cumulative target time for Output Compare Channel 1, taking account of any auto-reloading */
#define BITM_RTC_OC3TGT_RTCOC3TGT            (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Current, cumulative target time for Output Compare Channel 1, taking account of any auto-reloading */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC1LOWDUR                        Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC1LOWDUR_RTCOC1LOWDUR       0            /*  Low Duration for RTCOC1. */
#define BITM_RTC_OC1LOWDUR_RTCOC1LOWDUR      (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Low Duration for RTCOC1. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC2LOWDUR                        Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC2LOWDUR_RTCOC2LOWDUR       0            /*  Low Duration for RTCOC2. */
#define BITM_RTC_OC2LOWDUR_RTCOC2LOWDUR      (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Low Duration for RTCOC2. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC3LOWDUR                        Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC3LOWDUR_RTCOC3LOWDUR       0            /*  Low Duration for RTCOC3. */
#define BITM_RTC_OC3LOWDUR_RTCOC3LOWDUR      (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Low Duration for RTCOC3. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC1HIGHDUR                       Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC1HIGHDUR_RTCOC1HIGHDUR     0            /*  High Duration for RTCOC1. */
#define BITM_RTC_OC1HIGHDUR_RTCOC1HIGHDUR    (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  High Duration for RTCOC1. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC2HIGHDUR                       Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC2HIGHDUR_RTCOC2HIGHDUR     0            /*  High Duration for RTCOC2. */
#define BITM_RTC_OC2HIGHDUR_RTCOC2HIGHDUR    (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  High Duration for RTCOC2. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OC3HIGHDUR                       Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OC3HIGHDUR_RTCOC3HIGHDUR     0            /*  High Duration for RTCOC3. */
#define BITM_RTC_OC3HIGHDUR_RTCOC3HIGHDUR    (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  High Duration for RTCOC3. */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_OCMSKOT                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_OCMSKOT_RTCOC4MSKOT         12            /*  RTCOC4 on time control */
#define BITP_RTC_OCMSKOT_RTCOC3MSKOT          8            /*  RTCOC3 on time control */
#define BITP_RTC_OCMSKOT_RTCOC2MSKOT          4            /*  RTCOC2 on time control */
#define BITP_RTC_OCMSKOT_RTCOC1MSKOT          0            /*  Concatenation of thermometer-encoded masks for the 16-bit output compare channels */
#define BITM_RTC_OCMSKOT_RTCOC4MSKOT         (_ADI_MSK_3(0x0000F000,0x0000F000U, uint16_t  ))    /*  RTCOC4 on time control */
#define BITM_RTC_OCMSKOT_RTCOC3MSKOT         (_ADI_MSK_3(0x00000F00,0x00000F00U, uint16_t  ))    /*  RTCOC3 on time control */
#define BITM_RTC_OCMSKOT_RTCOC2MSKOT         (_ADI_MSK_3(0x000000F0,0x000000F0U, uint16_t  ))    /*  RTCOC2 on time control */
#define BITM_RTC_OCMSKOT_RTCOC1MSKOT         (_ADI_MSK_3(0x0000000F,0x0000000FU, uint16_t  ))    /*  Concatenation of thermometer-encoded masks for the 16-bit output compare channels */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR5OCS                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR5OCS_OC3SMPMTCHIRQEN      11            /*  Sample activity Interrupt enable for RTC Output Compare Channel 3 */
#define BITP_RTC_CR5OCS_OC3SMPEN              8            /*  GPIO input sample enable for RTC Output Compare Channel 3 */
#define BITP_RTC_CR5OCS_OC2SMPMTCHIRQEN       7            /*  Sample activity Interrupt enable for RTC Output Compare Channel 2 */
#define BITP_RTC_CR5OCS_OC2SMPEN              4            /*  GPIO input sample enable for RTC Output Compare Channel 2 */
#define BITP_RTC_CR5OCS_OC1SMPMTCHIRQEN       3            /*  Sample activity Interrupt enable for RTC Output Compare Channel 1. */
#define BITP_RTC_CR5OCS_OC1SMPEN              0            /*  GPIO input sample enable for RTC Output Compare Channel 1 */
#define BITM_RTC_CR5OCS_OC3SMPMTCHIRQEN      (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  Sample activity Interrupt enable for RTC Output Compare Channel 3 */
#define BITM_RTC_CR5OCS_OC3SMPEN             (_ADI_MSK_3(0x00000700,0x00000700U, uint16_t  ))    /*  GPIO input sample enable for RTC Output Compare Channel 3 */
#define BITM_RTC_CR5OCS_OC2SMPMTCHIRQEN      (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  Sample activity Interrupt enable for RTC Output Compare Channel 2 */
#define BITM_RTC_CR5OCS_OC2SMPEN             (_ADI_MSK_3(0x00000070,0x00000070U, uint16_t  ))    /*  GPIO input sample enable for RTC Output Compare Channel 2 */
#define BITM_RTC_CR5OCS_OC1SMPMTCHIRQEN      (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Sample activity Interrupt enable for RTC Output Compare Channel 1. */
#define BITM_RTC_CR5OCS_OC1SMPEN             (_ADI_MSK_3(0x00000007,0x00000007U, uint16_t  ))    /*  GPIO input sample enable for RTC Output Compare Channel 1 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR6OCS                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR6OCS_OC3SMPONRE           10            /*  GPIO Sample around Rising Edge of Output Compare Channel 3 */
#define BITP_RTC_CR6OCS_OC3SMPONFE            8            /*  GPIO Sample around Falling Edge of Output Compare Channel 3 */
#define BITP_RTC_CR6OCS_OC2SMPONRE            6            /*  GPIO Sample around Rising Edge of Output Compare Channel 2 */
#define BITP_RTC_CR6OCS_OC2SMPONFE            4            /*  GPIO Sample around Falling Edge of Output Compare Channel 2 */
#define BITP_RTC_CR6OCS_OC1SMPONRE            2            /*  GPIO Sample around Rising Edge of Output Compare Channel 1 */
#define BITP_RTC_CR6OCS_OC1SMPONFE            0            /*  GPIO Sample around Falling Edge of Output Compare Channel 1 */

#define BITM_RTC_CR6OCS_OC3SMPONRE           (_ADI_MSK_3(0x00000C00,0x00000C00U, uint16_t  ))    /*  GPIO Sample around Rising Edge of Output Compare Channel 3 */

#define BITM_RTC_CR6OCS_OC3SMPONFE           (_ADI_MSK_3(0x00000300,0x00000300U, uint16_t  ))    /*  GPIO Sample around Falling Edge of Output Compare Channel 3 */

