ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
#define BITM_RTC_CR6OCS_OC2SMPONRE           (_ADI_MSK_3(0x000000C0,0x000000C0U, uint16_t  ))    /*  GPIO Sample around Rising Edge of Output Compare Channel 2 */

#define BITM_RTC_CR6OCS_OC2SMPONFE           (_ADI_MSK_3(0x00000030,0x00000030U, uint16_t  ))    /*  GPIO Sample around Falling Edge of Output Compare Channel 2 */

#define BITM_RTC_CR6OCS_OC1SMPONRE           (_ADI_MSK_3(0x0000000C,0x0000000CU, uint16_t  ))    /*  GPIO Sample around Rising Edge of Output Compare Channel 1 */

#define BITM_RTC_CR6OCS_OC1SMPONFE           (_ADI_MSK_3(0x00000003,0x00000003U, uint16_t  ))    /*  GPIO Sample around Falling Edge of Output Compare Channel 1 */
#define ENUM_RTC_CR6OCS_OC3NORES             (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC3SMPONRE: No sampling of input around rising edge */
#define ENUM_RTC_CR6OCS_OC3BRES              (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  OC3SMPONRE: Input sampled one clock cycle before rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC3RES               (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  OC3SMPONRE: Input sampled at rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC3ARES              (_ADI_MSK_3(0x00000C00,0x00000C00U, uint16_t  ))    /*  OC3SMPONRE: Input sampled one clock cycle after rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC3NOFES             (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC3SMPONFE: No sampling of input around falling edge */
#define ENUM_RTC_CR6OCS_OC3BFES              (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  OC3SMPONFE: Input sampled one clock cycle before falling edge of OPC */
#define ENUM_RTC_CR6OCS_OC3FES               (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  OC3SMPONFE: Input sampled at falling edge of OPC */
#define ENUM_RTC_CR6OCS_OC3AFES              (_ADI_MSK_3(0x00000300,0x00000300U, uint16_t  ))    /*  OC3SMPONFE: Input sampled one clock cycle after falling edge of OPC */
#define ENUM_RTC_CR6OCS_OC2NORES             (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC2SMPONRE: No sampling of input around rising edge */
#define ENUM_RTC_CR6OCS_OC2BRES              (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  OC2SMPONRE: Input sampled one clock cycle before rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC2RES               (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  OC2SMPONRE: Input sampled at rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC2ARES              (_ADI_MSK_3(0x000000C0,0x000000C0U, uint16_t  ))    /*  OC2SMPONRE: Input sampled one clock cycle after rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC2NOFES             (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC2SMPONFE: No sampling of input around falling edge */
#define ENUM_RTC_CR6OCS_OC2BFES              (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  OC2SMPONFE: Input sampled one clock cycle before falling edge of OPC */
#define ENUM_RTC_CR6OCS_OC2FES               (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  OC2SMPONFE: Input sampled at falling edge of OPC */
#define ENUM_RTC_CR6OCS_OC2AFES              (_ADI_MSK_3(0x00000030,0x00000030U, uint16_t  ))    /*  OC2SMPONFE: Input sampled one clock cycle after falling edge of OPC */
#define ENUM_RTC_CR6OCS_OC1NORES             (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC1SMPONRE: No sampling of input around rising edge */
#define ENUM_RTC_CR6OCS_OC1BRES              (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  OC1SMPONRE: Input sampled one clock cycle before rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC1RES               (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  OC1SMPONRE: Input sampled at rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC1ARES              (_ADI_MSK_3(0x0000000C,0x0000000CU, uint16_t  ))    /*  OC1SMPONRE: Input sampled one clock cycle after rising edge of OPC */
#define ENUM_RTC_CR6OCS_OC1NOFES             (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC1SMPONFE: No sampling of input around falling edge */
#define ENUM_RTC_CR6OCS_OC1BFES              (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  OC1SMPONFE: Input sampled one clock cycle before falling edge of OPC */
#define ENUM_RTC_CR6OCS_OC1FES               (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  OC1SMPONFE: Input sampled at falling edge of OPC */
#define ENUM_RTC_CR6OCS_OC1AFES              (_ADI_MSK_3(0x00000003,0x00000003U, uint16_t  ))    /*  OC1SMPONFE: Input sampled one clock cycle after falling edge of OPC */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_CR7OCS                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_CR7OCS_OC3SMPPTRN           13            /*  Sample activity selection for Output Compare Channel 3 */
#define BITP_RTC_CR7OCS_OC3SMPEXP            10            /*  Expected GPIO Sample for Output Compare Channel 3 */
#define BITP_RTC_CR7OCS_OC2SMPPTRN            8            /*  Sample activity selection for Output Compare Channel 2 */
#define BITP_RTC_CR7OCS_OC2SMPEXP             5            /*  Expected GPIO Sample for Output Compare Channel 2 */
#define BITP_RTC_CR7OCS_OC1SMPPTRN            3            /*  Sample activity selection for Output Compare Channel 1 */
#define BITP_RTC_CR7OCS_OC1SMPEXP             0            /*  Expected GPIO Sample for Output Compare Channel 1 */

#define BITM_RTC_CR7OCS_OC3SMPPTRN           (_ADI_MSK_3(0x00006000,0x00006000U, uint16_t  ))    /*  Sample activity selection for Output Compare Channel 3 */
#define BITM_RTC_CR7OCS_OC3SMPEXP            (_ADI_MSK_3(0x00001C00,0x00001C00U, uint16_t  ))    /*  Expected GPIO Sample for Output Compare Channel 3 */

#define BITM_RTC_CR7OCS_OC2SMPPTRN           (_ADI_MSK_3(0x00000300,0x00000300U, uint16_t  ))    /*  Sample activity selection for Output Compare Channel 2 */
#define BITM_RTC_CR7OCS_OC2SMPEXP            (_ADI_MSK_3(0x000000E0,0x000000E0U, uint16_t  ))    /*  Expected GPIO Sample for Output Compare Channel 2 */

#define BITM_RTC_CR7OCS_OC1SMPPTRN           (_ADI_MSK_3(0x00000018,0x00000018U, uint16_t  ))    /*  Sample activity selection for Output Compare Channel 1 */
#define BITM_RTC_CR7OCS_OC1SMPEXP            (_ADI_MSK_3(0x00000007,0x00000007U, uint16_t  ))    /*  Expected GPIO Sample for Output Compare Channel 1 */
#define ENUM_RTC_CR7OCS_OC3SMPCHNG           (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC3SMPPTRN: Current GPIO sample is not same as previous sample */
#define ENUM_RTC_CR7OCS_OC3SMPSAME           (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  OC3SMPPTRN: Current GPIO sample is same as previous sample */
#define ENUM_RTC_CR7OCS_OC3SMPMTCH           (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  OC3SMPPTRN: Current GPIO sample is same as expected sample */
#define ENUM_RTC_CR7OCS_OC3SMPNOMTCH         (_ADI_MSK_3(0x00006000,0x00006000U, uint16_t  ))    /*  OC3SMPPTRN: Current GPIO sample is not same as expected sample */
#define ENUM_RTC_CR7OCS_OC2SMPCHNG           (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC2SMPPTRN: Current GPIO sample is not same as previous sample */
#define ENUM_RTC_CR7OCS_OC2SMPSAME           (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  OC2SMPPTRN: Current GPIO sample is same as previous sample */
#define ENUM_RTC_CR7OCS_OC2SMPMTCH           (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  OC2SMPPTRN: Current GPIO sample is same as expected sample */
#define ENUM_RTC_CR7OCS_OC2SMPNOMTCH         (_ADI_MSK_3(0x00000300,0x00000300U, uint16_t  ))    /*  OC2SMPPTRN: Current GPIO sample is not same as expected sample */
#define ENUM_RTC_CR7OCS_OC1SMPCHNG           (_ADI_MSK_3(0x00000000,0x00000000U, uint16_t  ))    /*  OC1SMPPTRN: Current GPIO sample is not same as previous sample */
#define ENUM_RTC_CR7OCS_OC1SMPSAME           (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  OC1SMPPTRN: Current GPIO sample is same as previous sample */
#define ENUM_RTC_CR7OCS_OC1SMPMTCH           (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  OC1SMPPTRN: Current GPIO sample is same as expected sample */
#define ENUM_RTC_CR7OCS_OC1SMPNOMTCH         (_ADI_MSK_3(0x00000018,0x00000018U, uint16_t  ))    /*  OC1SMPPTRN: Current GPIO sample is not same as expected sample */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR7                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR7_RTCOC4OUT               15            /*  Output value for RTC Output Compare Channel 4 */
#define BITP_RTC_SR7_RTCOC3OUT               14            /*  Output value for RTC Output Compare Channel 3 */
#define BITP_RTC_SR7_RTCOC2OUT               13            /*  Output value for RTC Output Compare Channel 2 */
#define BITP_RTC_SR7_RTCOC1OUT               12            /*  Output value for RTC Output Compare Channel 1 */
#define BITP_RTC_SR7_RTCOC3SMPMTCHIRQ        11            /*  Sticky status of GPIO sample pattern match for RTC Output Compare Channel 3 */
#define BITP_RTC_SR7_RTCOC3SMP                8            /*  Latest GPIO sample for RTC Output Compare Channel 3 */
#define BITP_RTC_SR7_RTCOC2SMPMTCHIRQ         7            /*  Sticky status of GPIO sample pattern match for RTC Output Compare Channel 2 */
#define BITP_RTC_SR7_RTCOC2SMP                4            /*  Latest GPIO sample for RTC Output Compare Channel 2 */
#define BITP_RTC_SR7_RTCOC1SMPMTCHIRQ         3            /*  Sticky status of GPIO sample pattern match for RTC Output Compare Channel 1 */
#define BITP_RTC_SR7_RTCOC1SMP                0            /*  Latest GPIO sample for RTC Output Compare Channel 1 */
#define BITM_RTC_SR7_RTCOC4OUT               (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Output value for RTC Output Compare Channel 4 */
#define BITM_RTC_SR7_RTCOC3OUT               (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Output value for RTC Output Compare Channel 3 */
#define BITM_RTC_SR7_RTCOC2OUT               (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Output value for RTC Output Compare Channel 2 */
#define BITM_RTC_SR7_RTCOC1OUT               (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Output value for RTC Output Compare Channel 1 */
#define BITM_RTC_SR7_RTCOC3SMPMTCHIRQ        (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  Sticky status of GPIO sample pattern match for RTC Output Compare Channel 3 */
#define BITM_RTC_SR7_RTCOC3SMP               (_ADI_MSK_3(0x00000700,0x00000700U, uint16_t  ))    /*  Latest GPIO sample for RTC Output Compare Channel 3 */
#define BITM_RTC_SR7_RTCOC2SMPMTCHIRQ        (_ADI_MSK_3(0x00000080,0x00000080U, uint16_t  ))    /*  Sticky status of GPIO sample pattern match for RTC Output Compare Channel 2 */
#define BITM_RTC_SR7_RTCOC2SMP               (_ADI_MSK_3(0x00000070,0x00000070U, uint16_t  ))    /*  Latest GPIO sample for RTC Output Compare Channel 2 */
#define BITM_RTC_SR7_RTCOC1SMPMTCHIRQ        (_ADI_MSK_3(0x00000008,0x00000008U, uint16_t  ))    /*  Sticky status of GPIO sample pattern match for RTC Output Compare Channel 1 */
#define BITM_RTC_SR7_RTCOC1SMP               (_ADI_MSK_3(0x00000007,0x00000007U, uint16_t  ))    /*  Latest GPIO sample for RTC Output Compare Channel 1 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR8                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR8_WSYNCGPMUX1             13            /*  Synchronization status of posted writes to RTCGPMUX1 pin mux control for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCGPMUX0             12            /*  Synchronization status of posted writes to RTCGPMUX0 pin mux control for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCSR7                11            /*  Synchronization status of posted writes to RTCSR7 sample control for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCCR7OCS             10            /*  Synchronization status of posted writes to RTCOC3 sample control for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCCR6OCS              9            /*  Synchronization status of posted writes to RTCOC2 sample control for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCCR5OCS              8            /*  Synchronization status of posted writes to RTCOC1 sample control for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCOC3HIGHDUR          6            /*  Synchronization status of posted writes to RTCOC3 low duration for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCOC2HIGHDUR          5            /*  Synchronization status of posted writes to RTCOC2 low duration for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCOC1HIGHDUR          4            /*  Synchronization status of posted writes to RTCOC1 low duration for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCOC3LOWDUR           2            /*  Synchronization status of posted writes to RTCOC3 low duration for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCOC2LOWDUR           1            /*  Synchronization status of posted writes to RTCOC2 low duration for Output Compare Channel Register */
#define BITP_RTC_SR8_WSYNCOC1LOWDUR           0            /*  Synchronization status of posted writes to RTCOC1 low duration for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCGPMUX1             (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Synchronization status of posted writes to RTCGPMUX1 pin mux control for Output Compare Channel Register */

