ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
#define BITM_RTC_SR8_WSYNCGPMUX0             (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Synchronization status of posted writes to RTCGPMUX0 pin mux control for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCSR7                (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  Synchronization status of posted writes to RTCSR7 sample control for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCCR7OCS             (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC3 sample control for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCCR6OCS             (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC2 sample control for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCCR5OCS             (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC1 sample control for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCOC3HIGHDUR         (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC3 low duration for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCOC2HIGHDUR         (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC2 low duration for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCOC1HIGHDUR         (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC1 low duration for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCOC3LOWDUR          (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC3 low duration for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCOC2LOWDUR          (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC2 low duration for Output Compare Channel Register */

#define BITM_RTC_SR8_WSYNCOC1LOWDUR          (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Synchronization status of posted writes to RTCOC1 low duration for Output Compare Channel Register */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_SR9                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_SR9_WPENDGPMUX1             13            /*  Pending status of posted writes to RTCGPMUX1 for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDGPMUX0             12            /*  Pending status of posted writes to RTCGPMUX0 for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDSR7                11            /*  Pending status of posted writes to RTCSR7 status for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDCR7OCS             10            /*  Pending status of posted writes to RTCOC3 Sample control for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDCR6OCS              9            /*  Pending status of posted writes to RTCOC2 Sample control for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDCR5OCS              8            /*  Pending status of posted writes to RTCOC1 Sample control for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDOC3HIGHDUR          6            /*  Pending status of posted writes to RTCOC3 High Duration for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDOC2HIGHDUR          5            /*  Pending status of posted writes to RTCOC2 High Duration for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDOC1HIGHDUR          4            /*  Pending status of posted writes to RTCOC1 High Duration for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDOC3LOWDUR           2            /*  Pending status of posted writes to RTCOC3 Low Duration for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDOC2LOWDUR           1            /*  Pending status of posted writes to RTCOC2 Low Duration for Output Compare Channel Register */
#define BITP_RTC_SR9_WPENDOC1LOWDUR           0            /*  Pending status of posted writes to RTCOC1 Low Duration for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDGPMUX1             (_ADI_MSK_3(0x00002000,0x00002000U, uint16_t  ))    /*  Pending status of posted writes to RTCGPMUX1 for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDGPMUX0             (_ADI_MSK_3(0x00001000,0x00001000U, uint16_t  ))    /*  Pending status of posted writes to RTCGPMUX0 for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDSR7                (_ADI_MSK_3(0x00000800,0x00000800U, uint16_t  ))    /*  Pending status of posted writes to RTCSR7 status for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDCR7OCS             (_ADI_MSK_3(0x00000400,0x00000400U, uint16_t  ))    /*  Pending status of posted writes to RTCOC3 Sample control for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDCR6OCS             (_ADI_MSK_3(0x00000200,0x00000200U, uint16_t  ))    /*  Pending status of posted writes to RTCOC2 Sample control for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDCR5OCS             (_ADI_MSK_3(0x00000100,0x00000100U, uint16_t  ))    /*  Pending status of posted writes to RTCOC1 Sample control for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDOC3HIGHDUR         (_ADI_MSK_3(0x00000040,0x00000040U, uint16_t  ))    /*  Pending status of posted writes to RTCOC3 High Duration for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDOC2HIGHDUR         (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  Pending status of posted writes to RTCOC2 High Duration for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDOC1HIGHDUR         (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  Pending status of posted writes to RTCOC1 High Duration for Output Compare Channel Register */

