ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
#define BITM_RTC_SR9_WPENDOC3LOWDUR          (_ADI_MSK_3(0x00000004,0x00000004U, uint16_t  ))    /*  Pending status of posted writes to RTCOC3 Low Duration for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDOC2LOWDUR          (_ADI_MSK_3(0x00000002,0x00000002U, uint16_t  ))    /*  Pending status of posted writes to RTCOC2 Low Duration for Output Compare Channel Register */

#define BITM_RTC_SR9_WPENDOC1LOWDUR          (_ADI_MSK_3(0x00000001,0x00000001U, uint16_t  ))    /*  Pending status of posted writes to RTCOC1 Low Duration for Output Compare Channel Register */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_GPMUX0                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_GPMUX0_OC2GPIN1SEL          12            /*  GPIO mux selection for output compare channel2 input1 */
#define BITP_RTC_GPMUX0_OC2GPIN0SEL           9            /*  GPIO mux selection for output compare channel2 input0 */
#define BITP_RTC_GPMUX0_OC1GPIN2SEL           6            /*  GPIO mux selection for output compare channel1 input2 */
#define BITP_RTC_GPMUX0_OC1GPIN1SEL           3            /*  GPIO mux selection for output compare channel1 input1 */
#define BITP_RTC_GPMUX0_OC1GPIN0SEL           0            /*  GPIO mux selection for output compare channel1 input0 */
#define BITM_RTC_GPMUX0_OC2GPIN1SEL          (_ADI_MSK_3(0x00007000,0x00007000U, uint16_t  ))    /*  GPIO mux selection for output compare channel2 input1 */
#define BITM_RTC_GPMUX0_OC2GPIN0SEL          (_ADI_MSK_3(0x00000E00,0x00000E00U, uint16_t  ))    /*  GPIO mux selection for output compare channel2 input0 */
#define BITM_RTC_GPMUX0_OC1GPIN2SEL          (_ADI_MSK_3(0x000001C0,0x000001C0U, uint16_t  ))    /*  GPIO mux selection for output compare channel1 input2 */
#define BITM_RTC_GPMUX0_OC1GPIN1SEL          (_ADI_MSK_3(0x00000038,0x00000038U, uint16_t  ))    /*  GPIO mux selection for output compare channel1 input1 */
#define BITM_RTC_GPMUX0_OC1GPIN0SEL          (_ADI_MSK_3(0x00000007,0x00000007U, uint16_t  ))    /*  GPIO mux selection for output compare channel1 input0 */

/* -------------------------------------------------------------------------------------------------------------------------
          RTC_GPMUX1                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_RTC_GPMUX1_OC3DIFFOUT           15            /*  Differential OPC out option for output compare channel3 */
#define BITP_RTC_GPMUX1_OC1DIFFOUT           14            /*  Differential OPC out option for output compare channel1 */
#define BITP_RTC_GPMUX1_OC3GPIN2SEL           9            /*  GPIO mux selection for output compare channel3 input2 */
#define BITP_RTC_GPMUX1_OC3GPIN1SEL           6            /*  GPIO mux selection for output compare channel3 input1 */
#define BITP_RTC_GPMUX1_OC3GPIN0SEL           3            /*  GPIO mux selection for output compare channel3 input0 */
#define BITP_RTC_GPMUX1_OC2GPIN2SEL           0            /*  GPIO mux selection for output compare channel2 input2 */
#define BITM_RTC_GPMUX1_OC3DIFFOUT           (_ADI_MSK_3(0x00008000,0x00008000U, uint16_t  ))    /*  Differential OPC out option for output compare channel3 */
#define BITM_RTC_GPMUX1_OC1DIFFOUT           (_ADI_MSK_3(0x00004000,0x00004000U, uint16_t  ))    /*  Differential OPC out option for output compare channel1 */
#define BITM_RTC_GPMUX1_OC3GPIN2SEL          (_ADI_MSK_3(0x00000E00,0x00000E00U, uint16_t  ))    /*  GPIO mux selection for output compare channel3 input2 */
#define BITM_RTC_GPMUX1_OC3GPIN1SEL          (_ADI_MSK_3(0x000001C0,0x000001C0U, uint16_t  ))    /*  GPIO mux selection for output compare channel3 input1 */
#define BITM_RTC_GPMUX1_OC3GPIN0SEL          (_ADI_MSK_3(0x00000038,0x00000038U, uint16_t  ))    /*  GPIO mux selection for output compare channel3 input0 */
#define BITM_RTC_GPMUX1_OC2GPIN2SEL          (_ADI_MSK_3(0x00000007,0x00000007U, uint16_t  ))    /*  GPIO mux selection for output compare channel2 input2 */


/* ============================================================================================================================
        System Identification and Debug Enable
   ============================================================================================================================ */

/* ============================================================================================================================
        SYS
   ============================================================================================================================ */
#define REG_SYS_ADIID                        0x40002020            /*  SYS ADI Identification */
#define REG_SYS_CHIPID                       0x40002024            /*  SYS Chip Identifier */
#define REG_SYS_SWDEN                        0x40002040            /*  SYS Serial Wire Debug Enable */

/* ============================================================================================================================
        SYS Register BitMasks, Positions & Enumerations 
   ============================================================================================================================ */
/* -------------------------------------------------------------------------------------------------------------------------
          SYS_ADIID                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SYS_ADIID_VALUE                  0            /*  Reads a fixed value of 0x4144 to indicate to debuggers that they are connected to an Analog Devices implemented Cortex based part. */
#define BITM_SYS_ADIID_VALUE                 (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Reads a fixed value of 0x4144 to indicate to debuggers that they are connected to an Analog Devices implemented Cortex based part. */

/* -------------------------------------------------------------------------------------------------------------------------
          SYS_CHIPID                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SYS_CHIPID_PARTID                4            /*  Part identifier */
#define BITP_SYS_CHIPID_REV                   0            /*  Silicon revision */
#define BITM_SYS_CHIPID_PARTID               (_ADI_MSK_3(0x0000FFF0,0x0000FFF0U, uint16_t  ))    /*  Part identifier */

#define BITM_SYS_CHIPID_REV                  (_ADI_MSK_3(0x0000000F,0x0000000FU, uint16_t  ))    /*  Silicon revision */

/* -------------------------------------------------------------------------------------------------------------------------
          SYS_SWDEN                            Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_SYS_SWDEN_VALUE                  0            /*  Writing the SWDEN register with "en" (0x6E65) or "EN" (0x4E45) will enable the SWD interface */
#define BITM_SYS_SWDEN_VALUE                 (_ADI_MSK_3(0x0000FFFF,0x0000FFFFU, uint16_t  ))    /*  Writing the SWDEN register with "en" (0x6E65) or "EN" (0x4E45) will enable the SWD interface */


