ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
#define BITM_SPI_CS_OVERRIDE_CTL             (_ADI_MSK_3(0x00000003,0x00000003U, uint16_t  ))    /*  CS Override Control */


/* ============================================================================================================================
        
   ============================================================================================================================ */

/* ============================================================================================================================
        UART0
   ============================================================================================================================ */
#define REG_UART0_RX                         0x40005000            /*  UART0 Receive Buffer Register */
#define REG_UART0_TX                         0x40005000            /*  UART0 Transmit Holding Register */
#define REG_UART0_IEN                        0x40005004            /*  UART0 Interrupt Enable */
#define REG_UART0_IIR                        0x40005008            /*  UART0 Interrupt ID */
#define REG_UART0_LCR                        0x4000500C            /*  UART0 Line Control */
#define REG_UART0_MCR                        0x40005010            /*  UART0 Modem Control */
#define REG_UART0_LSR                        0x40005014            /*  UART0 Line Status */
#define REG_UART0_MSR                        0x40005018            /*  UART0 Modem Status */
#define REG_UART0_SCR                        0x4000501C            /*  UART0 Scratch Buffer */
#define REG_UART0_FCR                        0x40005020            /*  UART0 FIFO Control */
#define REG_UART0_FBR                        0x40005024            /*  UART0 Fractional Baud Rate */
#define REG_UART0_DIV                        0x40005028            /*  UART0 Baudrate Divider */
#define REG_UART0_LCR2                       0x4000502C            /*  UART0 Second Line Control */
#define REG_UART0_CTL                        0x40005030            /*  UART0 UART Control Register */
#define REG_UART0_RFC                        0x40005034            /*  UART0 RX FIFO Byte Count */
#define REG_UART0_TFC                        0x40005038            /*  UART0 TX FIFO Byte Count */
#define REG_UART0_RSC                        0x4000503C            /*  UART0 RS485 Half-duplex Control */
#define REG_UART0_ACR                        0x40005040            /*  UART0 Auto Baud Control */
#define REG_UART0_ASRL                       0x40005044            /*  UART0 Auto Baud Status (Low) */
#define REG_UART0_ASRH                       0x40005048            /*  UART0 Auto Baud Status (High) */

/* ============================================================================================================================
        UART1
   ============================================================================================================================ */
#define REG_UART1_RX                         0x40005400            /*  UART1 Receive Buffer Register */
#define REG_UART1_TX                         0x40005400            /*  UART1 Transmit Holding Register */
#define REG_UART1_IEN                        0x40005404            /*  UART1 Interrupt Enable */
#define REG_UART1_IIR                        0x40005408            /*  UART1 Interrupt ID */
#define REG_UART1_LCR                        0x4000540C            /*  UART1 Line Control */
#define REG_UART1_MCR                        0x40005410            /*  UART1 Modem Control */
#define REG_UART1_LSR                        0x40005414            /*  UART1 Line Status */
#define REG_UART1_MSR                        0x40005418            /*  UART1 Modem Status */
#define REG_UART1_SCR                        0x4000541C            /*  UART1 Scratch Buffer */
#define REG_UART1_FCR                        0x40005420            /*  UART1 FIFO Control */
#define REG_UART1_FBR                        0x40005424            /*  UART1 Fractional Baud Rate */
#define REG_UART1_DIV                        0x40005428            /*  UART1 Baudrate Divider */
#define REG_UART1_LCR2                       0x4000542C            /*  UART1 Second Line Control */
#define REG_UART1_CTL                        0x40005430            /*  UART1 UART Control Register */
#define REG_UART1_RFC                        0x40005434            /*  UART1 RX FIFO Byte Count */
#define REG_UART1_TFC                        0x40005438            /*  UART1 TX FIFO Byte Count */
#define REG_UART1_RSC                        0x4000543C            /*  UART1 RS485 Half-duplex Control */
#define REG_UART1_ACR                        0x40005440            /*  UART1 Auto Baud Control */
#define REG_UART1_ASRL                       0x40005444            /*  UART1 Auto Baud Status (Low) */
#define REG_UART1_ASRH                       0x40005448            /*  UART1 Auto Baud Status (High) */

/* ============================================================================================================================
        UART Register BitMasks, Positions & Enumerations 
   ============================================================================================================================ */
/* -------------------------------------------------------------------------------------------------------------------------
          UART_RX                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_RX_RBR                      0            /*  Receive Buffer Register */
#define BITM_UART_RX_RBR                     (_ADI_MSK_3(0x000000FF,0x000000FFU, uint16_t  ))    /*  Receive Buffer Register */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_TX                              Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_TX_THR                      0            /*  Transmit Holding Register */
#define BITM_UART_TX_THR                     (_ADI_MSK_3(0x000000FF,0x000000FFU, uint16_t  ))    /*  Transmit Holding Register */

/* -------------------------------------------------------------------------------------------------------------------------
          UART_IEN                             Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_UART_IEN_EDMAR                   5            /*  DMA requests in receive mode */
#define BITP_UART_IEN_EDMAT                   4            /*  DMA requests in transmit mode */
#define BITP_UART_IEN_EDSSI                   3            /*  Modem status interrupt */
#define BITP_UART_IEN_ELSI                    2            /*  Rx status interrupt */
#define BITP_UART_IEN_ETBEI                   1            /*  Transmit buffer empty interrupt */
#define BITP_UART_IEN_ERBFI                   0            /*  Receive buffer full interrupt */

#define BITM_UART_IEN_EDMAR                  (_ADI_MSK_3(0x00000020,0x00000020U, uint16_t  ))    /*  DMA requests in receive mode */

#define BITM_UART_IEN_EDMAT                  (_ADI_MSK_3(0x00000010,0x00000010U, uint16_t  ))    /*  DMA requests in transmit mode */

