ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/bsp/sys/adi_ADuCM4050.h
/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW1                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW1_KUW1                  0            /*  KUW[63:32] */
#define BITM_CRYPT_KUW1_KUW1                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[63:32] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW2                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW2_KUW2                  0            /*  KUW[95:64] */
#define BITM_CRYPT_KUW2_KUW2                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[95:64] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW3                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW3_KUW3                  0            /*  KUW[127:96] */
#define BITM_CRYPT_KUW3_KUW3                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[127:96] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW4                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW4_KUW4                  0            /*  KUW[159:128] */
#define BITM_CRYPT_KUW4_KUW4                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[159:128] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW5                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW5_KUW5                  0            /*  KUW[191:160] */
#define BITM_CRYPT_KUW5_KUW5                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[191:160] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW6                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW6_KUW6                  0            /*  KUW[223:192] */
#define BITM_CRYPT_KUW6_KUW6                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[223:192] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW7                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW7_KUW7                  0            /*  KUW[255:224] */
#define BITM_CRYPT_KUW7_KUW7                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[255:224] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW8                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW8_KUW8                  0            /*  KUW[287:256] */
#define BITM_CRYPT_KUW8_KUW8                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[287:256] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW9                           Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW9_KUW9                  0            /*  KUW[319:288] */
#define BITM_CRYPT_KUW9_KUW9                 (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[319:288] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW10                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW10_KUW10                0            /*  KUW[351:320] */
#define BITM_CRYPT_KUW10_KUW10               (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[351:320] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW11                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW11_KUW11                0            /*  KUW[383:352] */
#define BITM_CRYPT_KUW11_KUW11               (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[383:352] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW12                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW12_KUW12                0            /*  KUW[415:384] */
#define BITM_CRYPT_KUW12_KUW12               (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[415:384] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW13                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW13_KUW13                0            /*  KUW[447:416] */
#define BITM_CRYPT_KUW13_KUW13               (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[447:416] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW14                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW14_KUW14                0            /*  KUW[479:448] */
#define BITM_CRYPT_KUW14_KUW14               (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[479:448] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUW15                          Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUW15_KUW15                0            /*  KUW[511:480] */
#define BITM_CRYPT_KUW15_KUW15               (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  KUW[511:480] */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUWVALSTR1                     Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUWVALSTR1_INITALVALUE0    0            /*  Initial Value */
#define BITM_CRYPT_KUWVALSTR1_INITALVALUE0   (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  Initial Value */

/* -------------------------------------------------------------------------------------------------------------------------
          CRYPT_KUWVALSTR2                     Pos/Masks         Description
   ------------------------------------------------------------------------------------------------------------------------- */
#define BITP_CRYPT_KUWVALSTR2_INITIALVALUE1   0            /*  Initial Value */
#define BITM_CRYPT_KUWVALSTR2_INITIALVALUE1  (_ADI_MSK_3(0xFFFFFFFF,0xFFFFFFFFUL, uint32_t  ))    /*  Initial Value */


